In [2]:
%config InlineBackend.figure_formats = {'png', 'retina'}

In [3]:
taxi = pd.read_csv("train/train.csv")

In [4]:
taxi["count"] = 1

In [5]:
import datetime as dt

## pickup_datetime 살피기

In [6]:
# pd.to_datetime을 해줘야 pickup_datetime coulmn의 data type이 datetime으로 됨.
pickup_datetime_dt = pd.to_datetime(taxi["pickup_datetime"])
dropoff_datetime_dt = pd.to_datetime(taxi["dropoff_datetime"])

In [7]:
# trip_duration, count를 포함하고, pickup_datetime의 data로만 이루어진 dataframe(taxi_df1)을 만든다.
taxi_df1 = taxi.loc[:, ["trip_duration", "count"]]
taxi_df1["pickup_datetime"] = pickup_datetime_dt

In [8]:
# pickup datetime 중 year, month, day
taxi_df1.loc[:, "pickup_date"] = taxi_df1["pickup_datetime"].dt.date
# pickup datetime 중 month만 가져와서 새로 column을 만듦.
taxi_df1.loc[:, "pickup_month"] = taxi_df1["pickup_datetime"].dt.month
# pickup datetime 중 hour만 가져와서 새로 column을 만듦.
taxi_df1.loc[:, "pickup_hour"] = taxi_df1["pickup_datetime"].dt.hour
# pickup datetime 중 요일만 가져와서 새로 column을 만듦.
# 월요일은 0이고, 일요일은 6임.
taxi_df1.loc[:, "pickup_weekday"] = taxi_df1["pickup_datetime"].dt.weekday

In [9]:
taxi_df1.tail()

,trip_duration,count,pickup_datetime,pickup_date,pickup_month,pickup_hour,pickup_weekday
1458639,778,1,2016-04-08 13:31:04,2016-04-08,4,13,4
1458640,655,1,2016-01-10 07:35:15,2016-01-10,1,7,6
1458641,764,1,2016-04-22 06:57:41,2016-04-22,4,6,4
1458642,373,1,2016-01-05 15:56:26,2016-01-05,1,15,1
1458643,198,1,2016-04-05 14:44:25,2016-04-05,4,14,1

- year 살피기

In [10]:
print(taxi_df1["pickup_datetime"].dt.year.min())
print(taxi_df1["pickup_datetime"].dt.year.max())

2016
2016

- month 살피기

In [26]:
print(taxi_df1["pickup_month"].min())
print(taxi_df1["pickup_month"].max())

1
6

In [31]:
taxi_month_1 = taxi_df1.loc[:, ["pickup_month", "count"]]
taxi_month_1.groupby("pickup_month").sum()

               count
pickup_month
1             229707
2             238300
3             256189
4             251645
5             248487
6             234316

In [30]:
taxi_month_2 = taxi_df1.loc[:, ["pickup_month", "trip_duration"]]
taxi_month_2.groupby("pickup_month").mean()

              trip_duration
pickup_month
1                922.373319
2                920.830453
3                937.365363
4                962.891462
5                999.450555
6               1013.367226

- hour 살피기

In [27]:
print(taxi_df1["pickup_hour"].min())
print(taxi_df1["pickup_hour"].max())

0
23

In [32]:
taxi_month_1 = taxi_df1.loc[:, ["pickup_hour", "count"]]
taxi_month_1.groupby("pickup_hour").sum()

             count
pickup_hour
0            53248
1            38571
2            27972
3            20895
4            15792
5            15002
6            33248
7            55600
8            67053
9            67663
10           65437
11           68476
12           71873
13           71473
14           74292
15           71811
16           64313
17           76483
18           90600
19           90308
20           84072
21           84185
22           80492
23           69785

In [34]:
taxi_month_2 = taxi_df1.loc[:, ["pickup_hour", "trip_duration"]]
taxi_month_2.groupby("pickup_hour").mean()

             trip_duration
pickup_hour
0               936.657302
1               903.087112
2               890.076934
3               890.070878
4               921.976444
5               822.298960
6               797.434943
7               831.758345
8               924.559199
9               933.528915
10              933.367605
11              966.430282
12              993.533079
13             1032.246359
14             1075.789264
15             1118.832533
16             1080.146285
17             1030.581619
18              981.583234
19              894.356679
20              879.461545
21              890.521221
22             1023.455921
23              925.091409

- 요일 살피기

In [28]:
print(taxi_df1["pickup_weekday"].min())
print(taxi_df1["pickup_weekday"].max())

0
6

In [35]:
taxi_month_1 = taxi_df1.loc[:, ["pickup_weekday", "count"]]
taxi_month_1.groupby("pickup_weekday").sum()

                 count
pickup_weekday
0               187418
1               202749
2               210136
3               218574
4               223533
5               220868
6               195366

In [36]:
taxi_month_2 = taxi_df1.loc[:, ["pickup_weekday", "trip_duration"]]
taxi_month_2.groupby("pickup_weekday").mean()

                trip_duration
pickup_weekday
0                  897.947839
1                  983.463124
2                  975.450494
3                 1006.528654
4                  990.224200
5                  948.051175
6                  901.639395

### EDA of pickup_datetime
- year : 2016년 
- month : 1~6월
- hour : 0~23시
- weekday : 월요일~일요일